
## Plan Result (prod)




<pre><code>Plan: 2 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * module.application_insights.azurerm_application_insights.this
  * module.et-key-vault.azurerm_key_vault.kv
  * module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace
* Move
  * azurerm_application_insights.appinsights => module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://et-prod.vault.azure.net/secrets/app-insights-connection-string/21b737d1b4cd4fb39beb26dbd357c72b"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
        name                                  = "et-prod"
      ~ tags                                  = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "uksouth"
      + name                                   = "Application Insights daily cap reached - et-prod"
      + resource_group_name                    = "et-prod"
      + scopes                                 = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod",
        ]
      + severity                               = 4
      + tags                                   = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "production"
          + "managedBy"           = "Employment Tribunals"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C05URPSN326"
            }
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureActivity 
                  | where ResourceId == "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
                  | where OperationNameValue == "Microsoft.Insights/Components/DailyCapReached/Action"
                  | where Level == "Warning"
                  | where Category == "Administrative"
                  | where TimeGenerated > ago(1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

  # module.et-key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.KeyVault/vaults/et-prod"
        name                            = "et-prod"
      ~ tags                            = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/managed-identities-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/et-prod-mi"
        name                = "et-prod-mi"
      ~ tags                = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (5 unchanged attributes hidden)
    }

  # module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod"
        name                                = "et-sb-prod"
      ~ tags                                = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
        name                                  = "et-prod"
        tags                                  = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-tech"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":91,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->